import java.util.ArrayList;

class Hr{
	String _Char,_Kor = null;
	
	Hr(String Char, String Kor){
		_Char = Char; _Kor = Kor;
	}
}

public class Hiragana {
	ArrayList<Hr> H = new ArrayList<Hr>();
	
	String []Char = {"あ","い","う","え","お",  "か","き","く","け","こ",
					 "さ","し","す","せ","そ",  "た","ち","つ","て","と",
					 "な","に","ぬ","ね","の",  "は","ひ","ふ","へ","ほ",
					 "ま","み","む","め","も",  "や",    "ゆ",    "よ",
					 "ら","り","る","れ","ろ",  "わ",			 "を",
					 //
					 "が","ぎ","ぐ","げ","ご",  "ざ","じ","ず","ぜ","ぞ",
					 "だ","ぢ","づ","で","ど",  "ば","び","ぶ","べ","ぼ",
					 "ぱ","ぴ","ぷ","ぺ","ぽ",  "ん","っ","ゔ","끝"};
	
	String []Kor = {"아","이","우","에","오",  "카","키","쿠","케","코",
					"사","시","스","세","소",  "타","치","츠","테","토",
					"나","니","누","네","노",  "하","히","후","헤","호",
					"마","미","무","메","모",  "야",     "유",	 "요",
					"라","리","루","레","로",  "와",             "오",
					//
					"가","기","구","게","고",  "자","지","즈","제","조",
					"다","지","즈","데","도",  "바","비","부","베","보",
					"파","피","푸","페","포",  "응","읏","부","끝"};
	Hiragana(){
		for(int i =0; i <Char.length; i++) {
			H.add(new Hr(Char[i],Kor[i]));
		}
	}

}
